tap "heroku/brew"
tap "homebrew/bundle"
tap "stripe/stripe-cli"
brew "jpeg-xl"
brew "boost"
brew "glib"
brew "gcc"
brew "suite-sparse"
brew "ceres-solver"
brew "libidn2"
brew "p11-kit"
brew "unbound"
brew "gnutls"
brew "leptonica"
brew "libass"
brew "libbluray"
brew "libmicrohttpd"
brew "numpy"
brew "srt"
brew "tesseract"
brew "ffmpeg"
brew "open-mpi"
brew "ghostscript"
brew "guile"
brew "hadolint"
brew "libheif"
brew "imagemagick"
brew "libpq"
brew "librsvg"
brew "libyaml"
brew "netcdf"
brew "node-build"
brew "nodenv"
brew "nss"
brew "python@3.12"
brew "pyqt"
brew "vtk"
brew "opencv"
brew "poppler"
brew "pyenv"
brew "pyqt@5"
brew "python@3.10"
brew "python@3.11"
brew "ruby-build"
brew "rbenv"
brew "vips"
brew "yarn"
brew "zsh-autosuggestions"
brew "heroku/brew/heroku"
brew "stripe/stripe-cli/stripe"
cask "anaconda"
vscode "adpyke.vscode-sql-formatter"
vscode "bierner.markdown-checkbox"
vscode "bradlc.vscode-tailwindcss"
vscode "bung87.rails"
vscode "bung87.vscode-gemfile"
vscode "dbaeumer.vscode-eslint"
vscode "dotjoshjohnson.xml"
vscode "eamodio.gitlens"
vscode "elliotlarson.ruby-around-the-block"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "hashicorp.terraform"
vscode "ionutvmi.path-autocomplete"
vscode "jakebecker.elixir-ls"
vscode "karunamurti.rspec-snippets"
vscode "koichisasada.vscode-rdbg"
vscode "logerfo.procfile-support"
vscode "mechatroner.rainbow-csv"
vscode "mgmcdermott.vscode-language-babel"
vscode "mikestead.dotenv"
vscode "mitchdenny.ecdc"
vscode "mjmcloug.vscode-elixir"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.makefile-tools"
vscode "rayhanw.erb-helpers"
vscode "rust-lang.rust-analyzer"
vscode "sensourceinc.vscode-sql-beautify"
vscode "shopify.ruby-extensions-pack"
vscode "shopify.ruby-lsp"
vscode "sianglim.slim"
vscode "sorbet.sorbet-vscode-extension"
vscode "testdouble.vscode-standard-ruby"
vscode "thadeu.vscode-run-rspec-file"
vscode "timonwong.shellcheck"
